       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST09.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME       PIC X(10) VALUE 'JOHN'.
       01 WS-NUM        PIC 9(4) VALUE 1234.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY 'BEFORE-NAME:' WS-NAME
           DISPLAY 'BEFORE-NUM:' WS-NUM
           INITIALIZE WS-NAME
           INITIALIZE WS-NUM
           DISPLAY 'AFTER-NAME:' WS-NAME
           DISPLAY 'AFTER-NUM:' WS-NUM
           STOP RUN.
