       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST28.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A           PIC 9(4) VALUE 100.
       01 WS-B           PIC 9(4) VALUE 30.
       01 WS-C           PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       MAIN-PARA.
           SUBTRACT WS-B FROM WS-A GIVING WS-C
           DISPLAY 'SUB-GIVING:' WS-C
           DISPLAY 'A-UNCHANGED:' WS-A
           STOP RUN.
